import { Metadata } from 'next'

export const metadata: Metadata = {
	title: 'Політика конфіденційності',
}

export default function PrivacyPolicy() {
	return (
		<>
			<h1>Політика конфіденційності</h1>
			<div id='container-policy'>
				<h2>Основні дані</h2>
				<ul>
					<li>
						<b>Офіційна назва сайту:</b> Lin-Store
					</li>
					<li>
						<b>Єдина адреса електронної пошти:</b> (lin-store)
						officiallinstore@gmail.com
					</li>
				</ul>
				<h2>Умови використання сайту</h2>
				<p>
					Увага! Перш ніж переглядати цей сайт, уважно прочитайте умови. Якщо ви
					не погоджуєтесь з цими умовами, не використовуйте цей сайт
				</p>
				<h2>Використання сайту</h2>
				<p>
					Сайт/Інтернет-магазин Lin-Store дозволяє вам переглядати та
					завантажувати матеріали цього Сайту/Інтернет-магазину тільки для
					особистого некомерційного використання. Забороняється змінювати
					матеріали цього Сайту/Інтернет-магазину, а також розповсюджувати чи
					демонструвати їх у будь-якому вигляді або використовувати їх будь-яким
					іншим чином для громадських чи комерційних цілей. Будь-яке
					використання цих матеріалів на інших сайтах або комп'ютерних мережах
					забороняється.
				</p>
				<h2>Інформація про відмову відповідальності</h2>
				<p>
					Матеріали та послуги цього Сайту/Інтернет-магазину надаються «як є»
					без будь-яких гарантій. Lin-Store не гарантує точності та повноти
					матеріалів, програм та послуг, що надаються на цьому Сайті. Lin-Store
					у будь-який час без повідомлення може вносити зміни до матеріалів та
					послуг, що надаються на цьому Сайті, а також до згаданих у них
					продуктів та цін. У разі старіння матеріалів та послуг на цьому Сайті
					Lin-Store не зобов'язується оновлювати їх. Lin-Store за жодних
					обставин не несе відповідальності за будь-які збитки (включаючи, але
					не обмежуючись збитками від втрати прибутку, даних або від переривання
					ділової активності), що виник внаслідок використання, неможливості
					використання або результатів використання цього Сайту.
				</p>
				<h2>Реєстрація на сайті</h2>
				<p>
					Реєструючись на Сайті, ви погоджуєтесь надати достовірну та точну
					інформацію про себе та свої контактні дані, дані браузера та його
					оточення, а також приймаєте умови політики конфіденційності. В
					результаті реєстрації ви отримуєте логін та пароль, за безпеку яких ви
					несете відповідальність. Ви також несете відповідальність за всі дії
					під вашим логіном та паролем на Сайті.
				</p>
				<h2>Зворотній зв'язок та коментарі</h2>
				<p>
					Звертаючись до нас або залишаючи коментарі на Сайті, ви несете
					відповідальність, що це повідомлення не є незаконним, шкідливим,
					загрозливим, наклепницьким, ображає моральність, порушує авторські
					права, пропагує ненависть та/або дискримінацію людей з расової,
					етнічної, статевої, ознаками, що містить образи на адресу конкретних
					осіб чи організацій, а також якимось іншим чином порушує чинне
					законодавство України. Ви погоджуєтесь, що будь-яке повідомлення
					Lin-Store може видаляти без вашої на те згоди, а також безоплатно
					використовувати на свій розсуд. Lin-Store не несе відповідальності за
					будь-яку інформацію, розміщену користувачами Сайту.
				</p>
				<h2>Використання персональних даних</h2>
				<p>
					Ми використовуємо різні технології для збору та зберігання інформації,
					коли ви відвідуєте Сайт/Інтернет-магазин Lin-Store. Це може включати
					запис одного або декількох cookie, або анонімних ідентифікаторів. Ми
					використовуємо cookie та анонімні ідентифікатори для максимальної
					безпеки користувача та надання кращого користувальницького досвіду.
				</p>
				<h2>Повідомлення та розсилки</h2>
				<p>
					Lin-Store може надсилати вам повідомлення у відповідь на повідомлення
					(запитання та скарги) у вигляді листів електронної пошти, та
					відповідей у коментарях сайту. Lin-Store також може надсилати вам
					інформаційні розсилки, які містять інформацію про ваші коментарі,
					товари та/або послуги. Lin-Store здійснює інформаційне розсилання у
					вигляді електронних листів, зміни статусів замовлень.
				</p>
				<h2>Використання cookie</h2>
				<p>
					Ми використовуємо cookie для забезпечення безпеки та функціональності
					користувачів нашого сайту. Cookie - це невеликі текстові файли, які
					розміщуються на вашому пристрої під час відвідування веб-сайту. Вони
					дозволяють нам зберігати певну інформацію про вас, такі як дані для
					аутентифікації, щоб забезпечити безпеку та ефективну роботу нашого
					сайту та вашого користувальницького досвіду.
				</p>
				<h2>Види cookie, які ми використовуємо:</h2>
				<ul>
					<li>
						<b>Необхідні cookie:</b> Ці cookie необхідні для функціонування
						сайту і не можуть бути відключені в наших системах. Вони зазвичай
						встановлюються лише у відповідь на дії, вчинені вами, які є запитами
						на послуги, наприклад, вхід до системи. У разі відмови використання
						cookie не використовуйте цей сайт.
					</li>
					<li>
						<b>Функціональні cookie:</b> Ці cookie можуть запам'ятовувати ваше
						ім'я користувача. Інформація, зібрана цими cookie, зазвичай анонімна
						і не дозволяє відстежити вашу активність на інших веб-сайтах.
					</li>
					<li>
						<b>Аналітичні cookie:</b> Ми не використовуємо аналітичні cookie для
						збору інформації про вашу активність на нашому сайті.
					</li>
				</ul>

				<h2>Зберігання та обробка даних користувачів</h2>
				<p>
					Ми прагнемо забезпечити максимальну безпеку та конфіденційність даних
					наших користувачів. Нижче наведено основні принципи, які ми
					дотримуємося щодо зберігання та обробки даних:
				</p>
				<ul>
					<li>
						<b>Шифрування даних:</b> Усі дані, що передаються між вашим
						браузером та нашими серверами, захищені шифруванням за допомогою
						протоколу. Це забезпечує захищене з'єднання та запобігає
						несанкціонованому доступу до вашої інформації під час передачі.
					</li>
					<li>
						<b>Шифрування паролів:</b> Усі паролі, створені користувачами,
						шифруються на сервері перед збереженням у базі даних. Ми
						використовуємо сучасні методи шифрування для забезпечення безпеки
						паролів нашої спільноти.
					</li>
					<li>
						<b>Відсутність передачі даних третім особам:</b> Ми ніколи не
						надсилаємо вашу особисту інформацію третім особам без вашої згоди,
						за винятком випадків, передбачених законодавством. Ми поважаємо вашу
						конфіденційність та робимо все можливе, щоб захистити ваші дані від
						несанкціонованого доступу.
					</li>
					<li>
						<b>Збереження даних:</b> Ми зберігаємо ваші дані лише протягом
						необхідного часу для виконання цілей, для яких вони були зібрані,
						або відповідно до наших юридичних зобов'язань.
					</li>
				</ul>
				<h2>Зміни</h2>
				<p>
					Політика конфіденційності може оновлюватись і відображатиметься на
					самій сторінці політики конфіденційності.
				</p>
				<h2>Висновок</h2>
				<p>
					Ми не несемо відповідальності за будь-який контент, розміщений на
					сайті/інтернет-магазині Lin-Store третіми особами.
				</p>
			</div>
		</>
	)
}
